Revit 2027 API
ParameterTypeId.CouplerCoupledEngagement Property
 "Bar Engagement 2"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CouplerCoupledEngagement { get; }
Public Shared ReadOnly Property CouplerCoupledEngagement As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CouplerCoupledEngagement {
	ForgeTypeId^ get ();
}
static member CouplerCoupledEngagement : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace